blog/rails发送webhooks.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content=" Norris" />
<link rel="stylesheet" href="https://jgkamat.gitlab.io/src/jgkamat.css"/>
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb1053a6">1. 注册webhook endpoints</a></li>
<li><a href="#orgc67e89a">2. 构建events</a></li>
<li><a href="#org5d832f5">3. 触发事件</a></li>
<li><a href="#org348f898">4. 发送webhooks</a></li>
<li><a href="#org342327d">5. 总结</a></li>
</ul>
</div>
</div>
<blockquote>
<p>
今天看到一篇文章，手把手教你如何使用rails具体实现webhook，感觉写代码的思路值得学习，所以在这里大概摘抄下来。
</p>
</blockquote>

<p>
原文如下：<a href="https://benediktdeicke.com/2017/09/sending-webhooks-with-rails/">https://benediktdeicke.com/2017/09/sending-webhooks-with-rails/</a>
</p>

<pre class="example">
webhook其实就是：让别人在你这里注册一个终端地址，并在发生事件的时候给他们发送消息。通过这种方式把别人的服务集成到你的应用中。
</pre>

<div id="outline-container-orgb1053a6" class="outline-2">
<h2 id="orgb1053a6"><span class="section-number-2">1</span> 注册webhook endpoints</h2>
<div class="outline-text-2" id="text-1">
<p>
首先应当有个model，允许通过页面让别人输入他们需要收到通知的url，表单很简单就不写了。我们定义一个Webhook::Endpointmodel。
每个endpoint都应该有一个target url, 一组events，一个account表示endpoint属于它（比如uniqueway就是udesk的一个account），为了简单，使用postgresql的array columns存储events。
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #F0DFAF; font-weight: bold;">class</span> <span style="color: #7CB8BB;">CreateWebhookEndpoints</span> &lt; <span style="color: #7CB8BB;">ActiveRecord</span>::<span style="color: #7CB8BB;">Migration</span>[<span style="color: #BFEBBF;">5</span>.<span style="color: #BFEBBF;">2</span>]
  <span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #93E0E3;">change</span>
    create_table <span style="color: #BFEBBF;">:webhook_endpoints</span> <span style="color: #F0DFAF; font-weight: bold;">do</span> |t|
      t.string <span style="color: #BFEBBF;">:target_url</span>, <span style="color: #BFEBBF;">null:</span> <span style="color: #BFEBBF;">false</span> <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">null: false&#19981;&#20801;&#35768;&#26159;null</span>
      t.string <span style="color: #BFEBBF;">:events</span>, <span style="color: #BFEBBF;">null:</span> <span style="color: #BFEBBF;">false</span>, <span style="color: #BFEBBF;">array:</span> <span style="color: #BFEBBF;">true</span>
      t.references <span style="color: #BFEBBF;">:acount</span>, <span style="color: #BFEBBF;">foreign_key:</span> <span style="color: #BFEBBF;">true</span>, <span style="color: #BFEBBF;">null:</span> <span style="color: #BFEBBF;">false</span> <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">&#20648;&#23384;account_id</span>
      t.timestamps
      t.index <span style="color: #BFEBBF;">:events</span> <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">&#35774;&#32622;events&#20026;&#32034;&#24341;</span>
    <span style="color: #F0DFAF; font-weight: bold;">end</span>
  <span style="color: #F0DFAF; font-weight: bold;">end</span>
<span style="color: #F0DFAF; font-weight: bold;">end</span>
</pre>
</div>

<p>
然而我们把model定义为Endpoint，Webhook只是它的一个namespace，防止webhook在endpoint里名称重复。
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #F0DFAF; font-weight: bold;">module</span> <span style="color: #7CB8BB;">Webhook</span>
  <span style="color: #F0DFAF; font-weight: bold;">class</span> <span style="color: #7CB8BB;">Endpoint</span> &lt; <span style="color: #7CB8BB;">ApplicationRecord</span>
    attribute <span style="color: #BFEBBF;">:events</span>, <span style="color: #BFEBBF;">:string</span>, <span style="color: #BFEBBF;">array:</span> <span style="color: #BFEBBF;">true</span>, <span style="color: #BFEBBF;">default:</span> [] <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">&#23450;&#20041;events&#20026;array</span>

    validates <span style="color: #BFEBBF;">:target_url</span>, <span style="color: #BFEBBF;">presence:</span> <span style="color: #BFEBBF;">true</span>, <span style="color: #DCDCCC; font-weight: bold;">format</span>: <span style="color: #7CB8BB;">URI</span>.regexp(<span style="color: #CC9393;">%w(http https)</span>)
    validates <span style="color: #BFEBBF;">:events</span>, <span style="color: #BFEBBF;">presence:</span> <span style="color: #BFEBBF;">true</span>

    <span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #F0DFAF; font-weight: bold;">self</span>.<span style="color: #93E0E3;">table_name_prefix</span>
      <span style="color: #CC9393;">'webhook_'</span>
    <span style="color: #F0DFAF; font-weight: bold;">end</span>
  <span style="color: #F0DFAF; font-weight: bold;">end</span>
<span style="color: #F0DFAF; font-weight: bold;">end</span>
</pre>
</div>

<p>
然后我们定义一个scope，帮助endpoints快速筛选出包含某几个events的endpoints
</p>

<div class="org-src-container">
<pre class="src src-ruby">scope <span style="color: #BFEBBF;">:for_event</span>, -&gt; (events){ where(<span style="color: #CC9393;">'events @&gt; ARRAY[?]::varchar[]'</span>, <span style="color: #DCDCCC; font-weight: bold;">Array</span>(events)) }
</pre>
</div>

<p>
然后，我们复写一下events=方法，做一些value的标准化
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #93E0E3;">events=</span>(events)
  events = <span style="color: #DCDCCC; font-weight: bold;">Array</span>(events).map { |event|.to_s.underscore }
  <span style="color: #F0DFAF; font-weight: bold;">super</span>(<span style="color: #7CB8BB;">WebhookL</span>::<span style="color: #7CB8BB;">Event</span>::<span style="color: #7CB8BB;">EVENT_TYPES</span> &amp; events)
<span style="color: #F0DFAF; font-weight: bold;">end</span>
</pre>
</div>

<p>
然后我们写一个deliver方法，用来deliver一个event to 这个endpoint，我们暂时不写这个方法
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #93E0E3;">deliver</span>(event)
<span style="color: #F0DFAF; font-weight: bold;">end</span>
</pre>
</div>

<blockquote>
<p>
好吧，这些真的都不重要
</p>
</blockquote>
</div>
</div>

<div id="outline-container-orgc67e89a" class="outline-2">
<h2 id="orgc67e89a"><span class="section-number-2">2</span> 构建events</h2>
<div class="outline-text-2" id="text-2">
<p>
设想一下event的对象应该是个什么样，大概这样
</p>
<div class="org-src-container">
<pre class="src src-ruby">{
  <span style="color: #CC9393;">"event_name"</span>: <span style="color: #CC9393;">"project_created"</span>,
  <span style="color: #CC9393;">"project"</span>: {
    <span style="color: #CC9393;">"name"</span>: <span style="color: #CC9393;">"Example Project"</span>
  }
}
</pre>
</div>

<p>
所以定义一个model，这个类没必要集成ApplicationRecord
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #F0DFAF; font-weight: bold;">module</span> <span style="color: #7CB8BB;">Webhook</span>
  <span style="color: #F0DFAF; font-weight: bold;">class</span> <span style="color: #7CB8BB;">Event</span>
    <span style="color: #7CB8BB;">EVENT_TYPS</span> = <span style="color: #CC9393;">%w(</span>
<span style="color: #CC9393;">      project_created</span>
<span style="color: #CC9393;">      project_updated</span>
<span style="color: #CC9393;">      project_destroyed</span>
<span style="color: #CC9393;">    )</span>.freeze

    <span style="color: #DCDCCC; font-weight: bold;">attr_reader</span> <span style="color: #BFEBBF;">:event_name</span>, <span style="color: #BFEBBF;">:payload</span>

    <span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #93E0E3;">initialize</span>(event_name, payload = {})
      <span style="color: #DFAF8F;">@event_name</span> = event_name <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">event&#21517;&#23383;</span>
      <span style="color: #DFAF8F;">@payload</span> = payload <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">hash project </span>
    <span style="color: #F0DFAF; font-weight: bold;">end</span>

    <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">&#25105;&#20204;&#24819;&#25226;events&#36716;&#25104;&#19978;&#38754;&#25105;&#20204;&#24819;&#35201;&#30340;json&#26684;&#24335;&#65292;&#21487;&#20197;&#23450;&#20041;&#19968;&#20010;as_json</span>
    <span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #93E0E3;">as_json</span>(*args)
      hash = payload.transform_values <span style="color: #F0DFAF; font-weight: bold;">do</span> |value|
        serialize_resource(value).as_json(*args)
      <span style="color: #F0DFAF; font-weight: bold;">end</span>

      hash[<span style="color: #BFEBBF;">:event_name</span>] = event_name
      hash
    <span style="color: #F0DFAF; font-weight: bold;">end</span>

    <span style="color: #DCDCCC; font-weight: bold;">private</span>

    <span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #93E0E3;">serialize_resource</span>(resource) <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">&#21487;&#20197;&#22312;serializer&#30340;class&#20013;&#23450;&#20041;&#21253;&#21547;&#30340;&#23383;&#27573;&#65292;&#36825;&#26679;&#23601;&#19981;&#26159;&#25152;&#26377;&#23383;&#27573;&#37117;&#20250;&#26377;&#20102;</span>
      <span style="color: #7CB8BB;">ActiveModelSerializers</span>::<span style="color: #7CB8BB;">SerializableResource</span>.new(resource, {})
    <span style="color: #F0DFAF; font-weight: bold;">end</span>
  <span style="color: #F0DFAF; font-weight: bold;">end</span>
<span style="color: #F0DFAF; font-weight: bold;">end</span>
</pre>
</div>

<p>
这样就可以这么定义event了
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #7CB8BB;">Webhook</span>::<span style="color: #7CB8BB;">Event</span>.new(<span style="color: #BFEBBF;">:project_created</span>, { <span style="color: #BFEBBF;">project:</span> project })
</pre>
</div>
</div>
</div>

<div id="outline-container-org5d832f5" class="outline-2">
<h2 id="org5d832f5"><span class="section-number-2">3</span> 触发事件</h2>
<div class="outline-text-2" id="text-3">
<p>
我们把触发事件的方法放入一个module中，这样想触发事件的model只需要include这个module就好了。
我们首先定义webhhook<sub>scope</sub>，这个方法必须在不同的model重新定义
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #F0DFAF; font-weight: bold;">module</span> <span style="color: #7CB8BB;">Webhook</span>
  <span style="color: #F0DFAF; font-weight: bold;">module</span> <span style="color: #7CB8BB;">Delivery</span>
    <span style="color: #DCDCCC; font-weight: bold;">extend</span> <span style="color: #7CB8BB;">ActiveSupport</span>::<span style="color: #7CB8BB;">Concern</span>

    <span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #93E0E3;">webhook_scope</span>
      <span style="color: #DCDCCC; font-weight: bold;">raise</span> <span style="color: #7CB8BB;">NotImplementedError</span>
    <span style="color: #F0DFAF; font-weight: bold;">end</span>
  <span style="color: #F0DFAF; font-weight: bold;">end</span>
<span style="color: #F0DFAF; font-weight: bold;">end</span>
</pre>
</div>

<p>
接下来定义发布事件的方法deliver<sub>webhook</sub><sub>event</sub>，用来让所有已经注册这个事件的endpoint发布事件
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #93E0E3;">deliver_webhook_event</span>(event_name, payload)
  event = <span style="color: #7CB8BB;">Webhook</span>::<span style="color: #7CB8BB;">Event</span>.new(event_name, payload || {})
  webhook_scope.webhook_endpoints.for_event(event_name).each <span style="color: #F0DFAF; font-weight: bold;">do</span> |endpoint|
    endpoint.deliver(event)
  <span style="color: #F0DFAF; font-weight: bold;">end</span>
<span style="color: #F0DFAF; font-weight: bold;">end</span>
</pre>
</div>

<p>
可以进一步优化代码，让它更简洁
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #93E0E3;">webhook_payload</span> <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">&#36825;&#20010;&#26041;&#27861;&#26126;&#26174;&#38656;&#35201;&#22312;model&#24403;&#20013;&#37325;&#26032;&#23450;&#20041;</span>
  {}
<span style="color: #F0DFAF; font-weight: bold;">end</span>

<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #93E0E3;">deliver_webhook</span>(action)
  event_name = <span style="color: #CC9393;">"</span><span style="color: #DFAF8F;">#{self.class.name.underscore}</span><span style="color: #CC9393;">_</span><span style="color: #DFAF8F;">#{action}</span><span style="color: #CC9393;">"</span>
  deliver_webhook_event(event_name, webhook_payload)
<span style="color: #F0DFAF; font-weight: bold;">end</span>
</pre>
</div>

<p>
那么我们现在就可以在model中引用这些方法
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #F0DFAF; font-weight: bold;">class</span> <span style="color: #7CB8BB;">Project</span> &lt; <span style="color: #7CB8BB;">ApplicationRecord</span>
  <span style="color: #DCDCCC; font-weight: bold;">include</span> <span style="color: #7CB8BB;">Webhook</span>::<span style="color: #7CB8BB;">Delivery</span>

  after_commit <span style="color: #BFEBBF;">on:</span> <span style="color: #BFEBBF;">:create</span> <span style="color: #F0DFAF; font-weight: bold;">do</span>
    deliver_webhook(<span style="color: #BFEBBF;">:created</span>)
  <span style="color: #F0DFAF; font-weight: bold;">end</span>

  belongs_to <span style="color: #BFEBBF;">:account</span>

  <span style="color: #DCDCCC; font-weight: bold;">private</span>

  <span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #93E0E3;">webhook_scope</span>
    account
  <span style="color: #F0DFAF; font-weight: bold;">end</span>

  <span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #93E0E3;">webhook_payload</span>
    { <span style="color: #BFEBBF;">project:</span> <span style="color: #F0DFAF; font-weight: bold;">self</span> }
  <span style="color: #F0DFAF; font-weight: bold;">end</span>
<span style="color: #F0DFAF; font-weight: bold;">end</span>
</pre>
</div>

<p>
其实我们可以把这些回调函数放到另一个module里面
</p>
<blockquote>
<p>
这个操作可以借鉴一下
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #F0DFAF; font-weight: bold;">module</span> <span style="color: #7CB8BB;">Webhook</span>
  <span style="color: #F0DFAF; font-weight: bold;">module</span> <span style="color: #7CB8BB;">Observable</span>
    <span style="color: #DCDCCC; font-weight: bold;">extend</span> <span style="color: #7CB8BB;">ActiveSupport</span>::<span style="color: #7CB8BB;">Concern</span>
    <span style="color: #DCDCCC; font-weight: bold;">include</span> <span style="color: #7CB8BB;">Webhook</span>::<span style="color: #7CB8BB;">Delivery</span>

    included <span style="color: #F0DFAF; font-weight: bold;">do</span>
      after_commit <span style="color: #BFEBBF;">on:</span> <span style="color: #BFEBBF;">:create</span> <span style="color: #F0DFAF; font-weight: bold;">do</span>
        deliver_webhook(<span style="color: #BFEBBF;">:created</span>)
      <span style="color: #F0DFAF; font-weight: bold;">end</span>

      after_commit <span style="color: #BFEBBF;">on:</span> <span style="color: #BFEBBF;">:update</span> <span style="color: #F0DFAF; font-weight: bold;">do</span>
        deliver_webhook(<span style="color: #BFEBBF;">:updated</span>)
      <span style="color: #F0DFAF; font-weight: bold;">end</span>

      after_commit <span style="color: #BFEBBF;">on:</span> <span style="color: #BFEBBF;">:destroy</span> <span style="color: #F0DFAF; font-weight: bold;">do</span>
        deliver_webhook(<span style="color: #BFEBBF;">:destroyed</span>)
      <span style="color: #F0DFAF; font-weight: bold;">end</span>
    <span style="color: #F0DFAF; font-weight: bold;">end</span>
  <span style="color: #F0DFAF; font-weight: bold;">end</span>
<span style="color: #F0DFAF; font-weight: bold;">end</span>
</pre>
</div>

<blockquote>
<p>
此处注意回调函数用到是after<sub>commit</sub>，因为必须保证webhook是在数据已经储存到database之后才发出的。这样可以避免not found error。
</p>
</blockquote>

<p>
这样model就简化成了这样
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #F0DFAF; font-weight: bold;">class</span> <span style="color: #7CB8BB;">Project</span> &lt; <span style="color: #7CB8BB;">ApplicationRecord</span>
  <span style="color: #DCDCCC; font-weight: bold;">include</span> <span style="color: #7CB8BB;">Webhook</span>::<span style="color: #7CB8BB;">Observable</span>

  belongs_to <span style="color: #BFEBBF;">:account</span>

  <span style="color: #DCDCCC; font-weight: bold;">private</span>

  <span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #93E0E3;">webhook_scope</span>
    account
  <span style="color: #F0DFAF; font-weight: bold;">end</span>

  <span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #93E0E3;">webhook_payload</span>
    { <span style="color: #BFEBBF;">project:</span> <span style="color: #F0DFAF; font-weight: bold;">self</span> }
  <span style="color: #F0DFAF; font-weight: bold;">end</span>
<span style="color: #F0DFAF; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org348f898" class="outline-2">
<h2 id="org348f898"><span class="section-number-2">4</span> 发送webhooks</h2>
<div class="outline-text-2" id="text-4">
<p>
这里强烈建议使用异步任务来发送webhook，因为你是给第三方发送请求，你丫根本没法保证会发生什么。在这里我们就用sidekiq。
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #DCDCCC; font-weight: bold;">require</span> <span style="color: #CC9393;">'net/http'</span>

<span style="color: #F0DFAF; font-weight: bold;">module</span> <span style="color: #7CB8BB;">Webhook</span>
  <span style="color: #F0DFAF; font-weight: bold;">class</span> <span style="color: #7CB8BB;">DeliveryWorker</span>
    <span style="color: #DCDCCC; font-weight: bold;">include</span> <span style="color: #7CB8BB;">Sidekiq</span>::<span style="color: #7CB8BB;">Worker</span>

    <span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #93E0E3;">perform</span>(endpoint_id, payload)
      <span style="color: #F0DFAF; font-weight: bold;">return</span> <span style="color: #F0DFAF; font-weight: bold;">unless</span> endpoint = <span style="color: #7CB8BB;">Webhook</span>::<span style="color: #7CB8BB;">Endpoint</span>.find(endpoint_id)
      response = request(endpoint.target_url, payload)

      <span style="color: #F0DFAF; font-weight: bold;">case</span> response.code
      <span style="color: #F0DFAF; font-weight: bold;">when</span> <span style="color: #BFEBBF;">410</span>
        endpoint.destroy
      <span style="color: #F0DFAF; font-weight: bold;">when</span> <span style="color: #BFEBBF;">400</span>..<span style="color: #BFEBBF;">599</span>
        <span style="color: #DCDCCC; font-weight: bold;">raise</span> response.to_s
      <span style="color: #F0DFAF; font-weight: bold;">end</span>
    <span style="color: #F0DFAF; font-weight: bold;">end</span>
  <span style="color: #F0DFAF; font-weight: bold;">end</span>
<span style="color: #F0DFAF; font-weight: bold;">end</span>
</pre>
</div>

<blockquote>
<p>
这里根据不同的response.code做了不同的操作，可以学习一下
</p>
</blockquote>

<p>
我们还需要定义request方法，不过就是发送一个http，这里就不写了。
最后，我们需要在model中定义deliver方法
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #93E0E3;">deliver</span>(event)
  <span style="color: #7CB8BB;">Webhook</span>::<span style="color: #7CB8BB;">DeliveryWorker</span>.perform_async(id, event.to_json)
<span style="color: #F0DFAF; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org342327d" class="outline-2">
<h2 id="org342327d"><span class="section-number-2">5</span> 总结</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>deliver<sub>webhook</sub><sub>event方法是关键</sub>，把当前model的endpoints包含event<sub>name的全都执行</sub>，作用域很重要</li>
<li>使用异步任务，防止第三方的问题</li>
<li>使用好module封装，这是这篇文章很好的一点</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">

<div>
<p class="author">Author: <a href="https://gitlab.com/jgkamat/jgkamat.gitlab.io"> Norris</a></p>
<p class="date">Published: </p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.1 (<a href="https://orgmode.org">Org</a> mode 9.3.1)</p>
</div>
</div>
</body>
</html>
